Основные_объекты_Занятие_6/src/InformationRegisters/ФИОСотрудника/ФИОСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОСотрудника</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_6/src/InformationRegisters/ФИОСотрудника/RecordSetModule.bsl
//ДЗ 1.5.1
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	//Запись в этом наборе записей может быть только одна
	ЗаписьНабораЗаписей =  ЭтотОбъект.Получить(0);
	Сотрудник = ЗаписьНабораЗаписей.Сотрудник;
	
	//--Проверяем актуалные фамилию, имяи отчетство. 
	// Если совпадают с текущей записью набора записей, то будем изменять данные в справочнике
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФИОСотрудникаСрезПоследних.Фамилия,
	|	ФИОСотрудникаСрезПоследних.Имя,
	|	ФИОСотрудникаСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.ФИОСотрудника.СрезПоследних(, Сотрудник = &Сотрудник) КАК ФИОСотрудникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	
	Если Выборка.Фамилия = ЗаписьНабораЗаписей.Фамилия 
		И Выборка.Имя = ЗаписьНабораЗаписей.Имя
		И Выборка.Отчество = ЗаписьНабораЗаписей.Отчество Тогда
	
		Возврат;
	
	КонецЕсли;

	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	
	СотрудникОбъект.Наименование = ОбщийМодульНаСервереМожноВызватьСКлиента.СобратьФИО(
	ЗаписьНабораЗаписей.Фамилия
	,ЗаписьНабораЗаписей.Имя
	,ЗаписьНабораЗаписей.Отчество); 
	
	СотрудникОбъект.Записать();
	
КонецПроцедуры
